var __CML__GLOBAL = require("../../manifest.js");
__CML__GLOBAL.webpackJsonp([10],{

/***/ "../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/babel-loader/lib/index.js?{\"filename\":\"C:\\\\Users\\\\Administrator\\\\AppData\\\\Roaming\\\\npm\\\\node_modules\\\\chameleon-tool\\\\chameleon.js\"}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/chameleon-loader/src/selector.js?type=script&index=0&fileType=page&media=dev&cmlType=wx&isInjectBaseStyle=true&check={\"enable\":true,\"enableTypes\":[]}!./src/pages/phoneBook/phoneBook.cml":
/***/ (function(module, exports, __webpack_require__) {

Object.defineProperty(exports, "__esModule", {
  value: true
});

var _index = __webpack_require__("./node_modules/chameleon-api/src/interfaces/showToast/index.js");

var _index2 = _interopRequireDefault(_index);

var _index3 = __webpack_require__("./node_modules/chameleon-api/src/interfaces/createAnimation/index.js");

var _index4 = _interopRequireDefault(_index3);

var _chameleonRuntime = __webpack_require__("./node_modules/chameleon-runtime/index.js");

var _chameleonRuntime2 = _interopRequireDefault(_chameleonRuntime);

function _interopRequireDefault(obj) { return obj && obj.__esModule ? obj : { default: obj }; }

function _classCallCheck(instance, Constructor) { if (!(instance instanceof Constructor)) { throw new TypeError("Cannot call a class as a function"); } }

var animation = (0, _index4.default)();
var LOADMORE_COUNT = 4;

var List = function List() {
  _classCallCheck(this, List);

  this.data = {
    /**
     * list 配置 子元素必须是 cell 标签
     */
    bottomOffset: 20,
    animationState: [],
    animationData: [],
    animationChildData: [],
    topdomshowId: -1,
    topchilddomshowId: -1,
    toporgdomshowId: -1,
    lists: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    listsItem: ['A', 'B', 'C'],
    list: [{
      "哈尔滨三联药业股份有限公司集团总部内线": [{
        "高层": [{
          "秦剑飞": {
            "职务": "董事长兼总裁",
            "内线电话": "",
            "外线电话": "0451-51038989",
            "手机": "13804549898",
            "邮箱": "qinjianfei@medisan.cn"
          }
        }, {
          "诸葛国民": {
            "职务": "副董事长",
            "内线电话": "",
            "外线电话": "",
            "手机": "13806413102",
            "邮箱": "zhugeguomin@medisan.cn"
          }
        }, {
          "梁延飞": {
            "职务": "副总经理",
            "内线电话": "",
            "外线电话": "0451-57358627",
            "手机": "13504503143",
            "邮箱": "liangyanfei@medisan.cn"
          }
        }, {
          "赵庆福": {
            "职务": "副总经理",
            "内线电话": "",
            "外线电话": "0451-51705178",
            "手机": "13503616669",
            "邮箱": "zhaoqingfu@medisan.cn"
          }
        }, {
          "宁春荣": {
            "职务": "副总经理",
            "内线电话": "",
            "外线电话": "0451-51702375",
            "手机": "19903619379",
            "邮箱": "ningchunrong@medisan.cn"
          }
        }, {
          "韩冰": {
            "职务": "副总经理",
            "内线电话": "",
            "外线电话": "0451-51700887",
            "手机": "13945103519",
            "邮箱": "hanbing@medisan.cn"
          }
        }, {
          "姚发祥": {
            "职务": "副总经理",
            "内线电话": "",
            "外线电话": "0451-57355598",
            "手机": "18611783636",
            "邮箱": "yaofaxiang@medisan.cn"
          }
        }, {
          "范庆吉": {
            "职务": "副总经理",
            "内线电话": "",
            "外线电话": "0451-51705129",
            "手机": "13836002823",
            "邮箱": "fanqingji@medisan.cn"
          }
        }, {
          "王明新": {
            "职务": "副总经理",
            "内线电话": "",
            "外线电话": "010-65244586-807",
            "手机": "18611369255",
            "邮箱": "wangmingxin@medisan.cn"
          }
        }, {
          "关成山": {
            "职务": "副总经理",
            "内线电话": "",
            "外线电话": "0451-57355677",
            "手机": "13614515159",
            "邮箱": "guanchengshan@medisan.cn"
          }
        }, {
          "秦臻": {
            "职务": "总裁助理",
            "内线电话": "",
            "外线电话": "",
            "手机": "13633678989",
            "邮箱": "qinzhen@medisan.cn"
          }
        }, {
          "秦剑涛": {
            "职务": "董事长助理",
            "内线电话": "",
            "外线电话": "总机-60001",
            "手机": "13945016979",
            "邮箱": "qinjiantao@medisan.cn"
          }
        }, {
          "秦剑波": {
            "职务": "董事长助理",
            "内线电话": "",
            "外线电话": "总机-60002",
            "手机": "15004667369",
            "邮箱": "qinjianbo@medisan.cn"
          }
        }, {
          "袁再英": {
            "职务": "人力资源总监",
            "内线电话": "",
            "外线电话": "总机-60003",
            "手机": "13359877167",
            "邮箱": "yuanzaiying@medisan.cn"
          }
        }, {
          "魏长青": {
            "职务": "招投标总监",
            "内线电话": "",
            "外线电话": "总机-60005",
            "手机": "13845180502",
            "邮箱": "weichangqing@medisan.cn"
          }
        }, {
          "丛学智": {
            "职务": "储运部总监",
            "内线电话": "",
            "外线电话": "总机-60006",
            "手机": "13945658511",
            "邮箱": "congxuezhi@medisan.cn"
          }
        }, {
          "于代涛": {
            "职务": "总裁助理",
            "内线电话": "",
            "外线电话": "总机-60007",
            "手机": "13936286668",
            "邮箱": "yudaitao@medisan.cn"
          }
        }, {
          "史晓志": {
            "职务": "输液事业部总监",
            "内线电话": "",
            "外线电话": "总机-60008",
            "手机": "13904601116	",
            "邮箱": "shixiaozhi@medisan.cn"
          }
        }, {
          "包志鹏": {
            "职务": "奥拉西坦事业部总监",
            "内线电话": "",
            "外线电话": "总机-60009",
            "手机": "13633606661",
            "邮箱": "baozhipeng@medisan.cn"
          }
        }, {
          "赵志成": {
            "职务": "财务总监",
            "内线电话": "",
            "外线电话": "总机-60010",
            "手机": "13936453189",
            "邮箱": "zhaozhicheng@medisan.cn"
          }
        }, {
          "杨仕杰": {
            "职务": "设备总监",
            "内线电话": "",
            "外线电话": "总机-60011",
            "手机": "13895783524",
            "邮箱": "yangshijie@medisan.cn"
          }
        }, {
          "罗俊伟": {
            "职务": "工程总监",
            "内线电话": "",
            "外线电话": "总机-60012",
            "手机": "13936002001",
            "邮箱": "luojunwei@medisan.cn"
          }
        }, {
          "沈晓溪": {
            "职务": "董事长助理",
            "内线电话": "",
            "外线电话": "总机-60013",
            "手机": "13796760533",
            "邮箱": "shenxiaoxi@medisan.cn"
          }
        }, {
          "任延久": {
            "职务": "专家工程师",
            "内线电话": "",
            "外线电话": "总机-60015",
            "手机": "13945057021",
            "邮箱": "renyanjiu@medisan.cn"
          }
        }, {
          "刘津爱": {
            "职务": "临床医学中心总经理",
            "内线电话": "",
            "外线电话": "010-65244586-802",
            "手机": "18601339251",
            "邮箱": "liujinai@medisan.cn"
          }
        }, {
          "霍盛池": {
            "职务": "审计总监",
            "内线电话": "",
            "外线电话": "总机-60016",
            "手机": "15945049558",
            "邮箱": "huoshengchi@medisan.cn"
          }
        }, {
          "刘天宇": {
            "职务": "输液事业部总监",
            "内线电话": "",
            "外线电话": "总机-60017",
            "手机": "15846098886",
            "邮箱": "liutianyu@medisan.cn"
          }
        }, {
          "申贺": {
            "职务": "商务部总监",
            "内线电话": "",
            "外线电话": "总机-60018",
            "手机": "18502502777",
            "邮箱": "shenhe@medisan.cn"
          }
        }, {
          "王云龙": {
            "职务": "信息总监",
            "内线电话": "",
            "外线电话": "总机-60019",
            "手机": "18904667293",
            "邮箱": "wangyunlong@medisan.cn"
          }
        }, {
          "郭艳玲": {
            "职务": "销售运营部总监",
            "内线电话": "",
            "外线电话": "总机-60020",
            "手机": "13845094805",
            "邮箱": "guoyanling@medisan.cn"
          }
        }, {
          "李丽娜": {
            "职务": "财务费用总监",
            "内线电话": "",
            "外线电话": "总机-60021",
            "手机": "13114519254",
            "邮箱": "lilina@medisan.cn"
          }
        }, {
          "胡玉庆": {
            "职务": "研发技术中心主任",
            "内线电话": "",
            "外线电话": "总机-60022",
            "手机": "13704806921",
            "邮箱": "huyuqing@medisan.cn"
          }
        }, {
          "张宇": {
            "职务": "生产总监",
            "内线电话": "",
            "外线电话": "总机-60023",
            "手机": "13904601285",
            "邮箱": "zhangyu@medisan.cn"
          }
        }, {
          "赵民喜": {
            "职务": "兰西哈三联制药有限公司总经理",
            "内线电话": "",
            "外线电话": "0455-5359707",
            "手机": "15945165378",
            "邮箱": "zhaominxi@medisan.cn"
          }
        }, {
          "朱自红": {
            "职务": "兰西哈三联制药有限公司常务副总经理",
            "内线电话": "",
            "外线电话": "0455-5359701",
            "手机": "15804507008",
            "邮箱": "zhuzihong@medisan.cn"
          }
        }, {
          "秦虎": {
            "职务": "兰西哈三联制药有限公司设备总监",
            "内线电话": "",
            "外线电话": "0455-5359708-6279",
            "手机": "15945151382",
            "邮箱": "qinhu@medisan.cn"
          }
        }, {
          "牟春福": {
            "职务": "兰西哈三联制药有限公司生产总监",
            "内线电话": "",
            "外线电话": "0455-5359708-6027",
            "手机": "13946061820",
            "邮箱": "muchunfu@medisan.cn"
          }
        }, {
          "刘新宇": {
            "职务": "兰西哈三联制药有限公司工程技术研究中心主任",
            "内线电话": "",
            "外线电话": "0455-5359708-6288",
            "手机": "15846362813",
            "邮箱": "liuxinyu@medisan.cn"
          }
        }, {
          "王立成": {
            "职务": "兰西哈三联制药有限公司质量总监",
            "内线电话": "",
            "外线电话": "0455-5359708-6555",
            "手机": "13945172326",
            "邮箱": "wanglicheng@medisan.cn"
          }
        }, {
          "刘瑞仙": {
            "职务": "兰西哈三联制药有限公司能源总监",
            "内线电话": "",
            "外线电话": "0455-5359708-6021",
            "手机": "13836003080",
            "邮箱": "liuruixian@medisan.cn"
          }
        }, {
          "刘荣": {
            "职务": "北京哈三联科技有限责任公司总经理",
            "内线电话": "",
            "外线电话": "010-69701359-8001",
            "手机": "13810313474",
            "邮箱": "liurong@medisan.cn"
          }
        }, {
          "朱梅": {
            "职务": "北京哈三联科技有限责任公司质量总监",
            "内线电话": "",
            "外线电话": "010-69701359-8003",
            "手机": "13611169889",
            "邮箱": "zhumei@medisan.cn"
          }
        }, {
          "向松": {
            "职务": "北京哈三联科技有限责任公司合成总监",
            "内线电话": "",
            "外线电话": "010-69701359-8005",
            "手机": "13581725738",
            "邮箱": "xiangsong@medisan.cn"
          }
        }, {
          "程楠": {
            "职务": "北京湃驰泰克医药科技有限公司总经",
            "内线电话": "",
            "外线电话": "010-67866985",
            "手机": "13439404577",
            "邮箱": "chengnan@medisan.cn"
          }
        }, {
          "刘莱": {
            "职务": "北京湃驰泰克医药科技有限公司副总经理",
            "内线电话": "",
            "外线电话": "010-67866985",
            "手机": "13439041894",
            "邮箱": "liulai@medisan.cn"
          }
        }, {
          "申桂芬": {
            "职务": "北京湃驰泰克医药科技有限公司研究开发总监",
            "内线电话": "",
            "外线电话": "010-67866985",
            "手机": "15901565992",
            "邮箱": "shenguifen@medisan.cn"
          }
        }, {
          "李泉": {
            "职务": "济南循道科技有限公司总经理",
            "内线电话": "",
            "外线电话": "",
            "手机": "13805315875",
            "邮箱": "liquan@medisan.cn"
          }
        }]
      }, {
        "证券投资部": [{
          "办公室": {
            "电话号码": "60100"
          }
        }]
      }, {
        "审计中心": [{
          "刘凤荣": {
            "电话号码": 60200
          }
        }, {
          "张仙超": {
            "电话号码": 60200
          }
        }, {
          "高海江": {
            "电话号码": 60201
          }
        }, {
          "刘天舒": {
            "电话号码": 60202
          }
        }]
      }, {
        "总裁办": [{
          "秘书台": {
            "电话号码": 60300,
            "手机号码": 123456789,
            "邮箱": "shixiaoguang@medisan.cn"
          }
        }, {
          "石小光": {
            "电话号码": 60301,
            "手机号码": 123456789,
            "邮箱": "shixiaoguang@medisan.cn"
          }
        }, {
          "陈棋": {
            "电话号码": 60302,
            "手机号码": 123456789,
            "邮箱": "houxiaohu@medisan.cn"
          }
        }, {
          "侯骁虎": {
            "电话号码": 60303,
            "手机号码": 123456789,
            "邮箱": "houxiaohu@medisan.cn"
          }
        }, {
          "曲美玲": {
            "电话号码": 60305,
            "手机号码": 123456789,
            "邮箱": "houxiaohu@medisan.cn"
          }
        }, {
          "任丽尧": {
            "电话号码": 60306,
            "手机号码": 123456789,
            "邮箱": "houxiaohu@medisan.cn"
          }
        }]
      }, {
        "项目管理部": [{
          "办公室": {
            "电话号码": 60500
          }
        }]
      }, {
        "包材研发部": [{
          "办公室": {
            "电话号码": 60600
          }
        }, {
          "办公室": {
            "电话号码": 60601
          }
        }, {
          "办公室": {
            "电话号码": 60602
          }
        }, {
          "实验室": {
            "电话号码": 60603
          }
        }]
      }, {
        "质量研发部": [{
          "办公室": {
            "电话号码": 60700
          }
        }, {
          "办公室": {
            "电话号码": 60701
          }
        }, {
          "实验室": {
            "电话号码": 60702
          }
        }]
      }, {
        "知识产权部": [{
          "办公室": {
            "电话号码": 60800
          }
        }]
      }, {
        "研发中心质量管理部": [{
          "办公室": {
            "电话号码": 60900
          }
        }, {
          "办公室": {
            "电话号码": 60901
          }
        }]
      }, {
        "试剂中试车间": [{
          "办公室": {
            "电话号码": 61000
          }
        }]
      }, {
        "制剂研发部": [{
          "办公室": {
            "电话号码": 61100
          }
        }]
      }, {
        "针剂固体事业部": [{
          "孙文涛": {
            "电话号码": 61500
          }
        }]
      }, {
        "合作部": [{
          "孙文涛": {
            "电话号码": 61600
          }
        }]
      }, {
        "商务部": [{
          "姚方一": {
            "电话号码": 61500
          }
        }, {
          "张若贤": {
            "电话号码": 61701
          }
        }]
      }, {
        "销售运营部": [{
          "康博": {
            "电话号码": 61800
          }
        }, {
          "赵艳波": {
            "电话号码": 61801
          }
        }, {
          "赵娜": {
            "电话号码": 61802
          }
        }, {
          "王红": {
            "电话号码": 61803
          }
        }, {
          "李娜": {
            "电话号码": 61805
          }
        }, {
          "陈洁": {
            "电话号码": 61806
          }
        }, {
          "张晓雪": {
            "电话号码": 61807
          }
        }, {
          "曹薇薇": {
            "电话号码": 61808
          }
        }, {
          "李蒙蒙": {
            "电话号码": 61809
          }
        }, {
          "刘岩": {
            "电话号码": 61810
          }
        }, {
          "孟洋": {
            "电话号码": 61811
          }
        }, {
          "柳怡佳": {
            "电话号码": 61812
          }
        }, {
          "刘婷婷": {
            "电话号码": 61813
          }
        }, {
          "李莹莹": {
            "电话号码": 61815
          }
        }, {
          "朱健儒": {
            "电话号码": 61816
          }
        }, {
          "于良": {
            "电话号码": 61817
          }
        }, {
          "黄瑶淼": {
            "电话号码": 61818
          }
        }, {
          "王雪": {
            "电话号码": 61819
          }
        }, {
          "王珊珊": {
            "电话号码": 61820
          }
        }, {
          "张佳佳": {
            "电话号码": 61821
          }
        }, {
          "何钰": {
            "电话号码": 61822
          }
        }, {
          "高澈": {
            "电话号码": 61823
          }
        }, {
          "张雅楠": {
            "电话号码": 61825
          }
        }, {
          "刘惠慧": {
            "电话号码": 61826
          }
        }, {
          "李冬梅": {
            "电话号码": 61827
          }
        }, {
          "段孟雪": {
            "电话号码": 61828
          }
        }, {
          "于明明": {
            "电话号码": 61829
          }
        }, {
          "付雨晴": {
            "电话号码": 61830
          }
        }, {
          "宋于爽": {
            "电话号码": 61831
          }
        }, {
          "何海欢": {
            "电话号码": 61832
          }
        }, {
          "杨洋": {
            "电话号码": 61833
          }
        }, {
          "于婷婷": {
            "电话号码": 61835
          }
        }, {
          "李思彤": {
            "电话号码": 61836
          }
        }]
      }, {
        "市场支持部": [{
          "李婷": {
            "电话号码": 61900
          }
        }, {
          "孟凡阳": {
            "电话号码": 61901
          }
        }, {
          "付玉鑫": {
            "电话号码": 61902
          }
        }, {
          "战玲玲": {
            "电话号码": 61903
          }
        }, {
          "孙鸿瑞": {
            "电话号码": 61905
          }
        }, {
          "符丽艳": {
            "电话号码": 61906
          }
        }, {
          "李洋": {
            "电话号码": 61907
          }
        }, {
          "陈非非": {
            "电话号码": 61908
          }
        }, {
          "韩妍": {
            "电话号码": 61909
          }
        }, {
          "肖瑶": {
            "电话号码": 61910
          }
        }, {
          "于晓菲": {
            "电话号码": 61911
          }
        }, {
          "刘美迪": {
            "电话号码": 61912
          }
        }, {
          "张洋": {
            "电话号码": 61913
          }
        }, {
          "余红梅": {
            "电话号码": 61915
          }
        }, {
          "魏琳琳": {
            "电话号码": 61916
          }
        }, {
          "韩翠娟": {
            "电话号码": 61917
          }
        }, {
          "邹慧玲": {
            "电话号码": 61918
          }
        }, {
          "谢秀娟": {
            "电话号码": 61912
          }
        }, {
          "高秀丽": {
            "电话号码": 61919
          }
        }]
      }, {
        "营销中心质量管理部": [{
          "李翠翠": {
            "电话号码": 62000
          }
        }, {
          "颜雪": {
            "电话号码": 62001
          }
        }]
      }, {
        "售后服务部": [{
          "徐震": {
            "电话号码": 61600
          }
        }]
      }, {
        "生产部": [{
          "经理办公室": {
            "电话号码": 62200
          }
        }, {
          "办公室": {
            "电话号码": 62201
          }
        }, {
          "办公室": {
            "电话号码": 62202
          }
        }]
      }, {
        "动力车间": [{
          "办公室": {
            "电话号码": 62300
          }
        }, {
          "锅炉操作间": {
            "电话号码": 62301
          }
        }, {
          "二期变电所": {
            "电话号码": 62302
          }
        }, {
          "二期泵站": {
            "电话号码": 62303
          }
        }, {
          "三期泵站": {
            "电话号码": 62305
          }
        }, {
          "三期机修": {
            "电话号码": 62306
          }
        }, {
          "锅炉水化验": {
            "电话号码": 62307
          }
        }, {
          "二期变电所": {
            "电话号码": 62308
          }
        }]
      }, {
        "301车间": [{
          "办公室": {
            "电话号码": 62500
          }
        }, {
          "办公室": {
            "电话号码": 62501
          }
        }, {
          "办公室": {
            "电话号码": 62502
          }
        }, {
          "机修": {
            "电话号码": 62503
          }
        }, {
          "配制间": {
            "电话号码": 62505
          }
        }, {
          "吹灌封间": {
            "电话号码": 62506
          }
        }, {
          "整衣间": {
            "电话号码": 62507
          }
        }, {
          "配制间": {
            "电话号码": 62508
          }
        }, {
          "吹灌封间": {
            "电话号码": 62509
          }
        }, {
          "灭菌前室": {
            "电话号码": 62510
          }
        }, {
          "灭菌室": {
            "电话号码": 62511
          }
        }, {
          "灯检间": {
            "电话号码": 62512
          }
        }, {
          "包装间": {
            "电话号码": 62513
          }
        }, {
          "包装间": {
            "电话号码": 62515
          }
        }, {
          "包装间": {
            "电话号码": 62516
          }
        }, {
          "包装间": {
            "电话号码": 62517
          }
        }, {
          "存放间": {
            "电话号码": 62518
          }
        }]
      }, {
        "302车间": [{
          "办公室": {
            "电话号码": 62600
          }
        }, {
          "办公室": {
            "电话号码": 62601
          }
        }, {
          "办公室": {
            "电话号码": 62602
          }
        }, {
          "浓配": {
            "电话号码": 62603
          }
        }, {
          "灌装": {
            "电话号码": 62605
          }
        }, {
          "灭菌": {
            "电话号码": 62606
          }
        }, {
          "灯检": {
            "电话号码": 62607
          }
        }, {
          "包装": {
            "电话号码": 62608
          }
        }, {
          "C级走廊": {
            "电话号码": 62609
          }
        }, {
          "稀配": {
            "电话号码": 62610
          }
        }]
      }, {
        "303车间": [{
          "办公室": {
            "电话号码": 62700
          }
        }, {
          "办公室": {
            "电话号码": 62701
          }
        }, {
          "进料间": {
            "电话号码": 62702
          }
        }, {
          "机修": {
            "电话号码": 62703
          }
        }, {
          "冻干": {
            "电话号码": 62705
          }
        }, {
          "前室": {
            "电话号码": 62706
          }
        }, {
          "配剂": {
            "电话号码": 62707
          }
        }, {
          "灌装": {
            "电话号码": 62708
          }
        }, {
          "外请间": {
            "电话号码": 62709
          }
        }, {
          "外包装": {
            "电话号码": 62710
          }
        }, {
          "热封检查间": {
            "电话号码": 62711
          }
        }, {
          "下料间": {
            "电话号码": 62712
          }
        }, {
          "D1区洗衣间": {
            "电话号码": 62713
          }
        }, {
          "工器具处理间": {
            "电话号码": 62715
          }
        }]
      }, {
        "304车间": [{
          "办公室": {
            "电话号码": 62800
          }
        }, {
          "办公室": {
            "电话号码": 62801
          }
        }, {
          "办公室": {
            "电话号码": 62802
          }
        }, {
          "配剂": {
            "电话号码": 62803
          }
        }, {
          "器具": {
            "电话号码": 62805
          }
        }, {
          "洗衣间": {
            "电话号码": 62806
          }
        }, {
          "灌封": {
            "电话号码": 62807
          }
        }, {
          "洗瓶": {
            "电话号码": 62808
          }
        }, {
          "吹灌封间": {
            "电话号码": 62809
          }
        }, {
          "冲裁间": {
            "电话号码": 62810
          }
        }, {
          "灭菌": {
            "电话号码": 62811
          }
        }, {
          "辅机间": {
            "电话号码": 62812
          }
        }, {
          "灯检": {
            "电话号码": 62813
          }
        }, {
          "机修": {
            "电话号码": 62815
          }
        }, {
          "门厅": {
            "电话号码": 62816
          }
        }]
      }, {
        "306车间": [{
          "办公室": {
            "电话号码": 62900
          }
        }, {
          "办公室": {
            "电话号码": 62901
          }
        }, {
          "制粒间": {
            "电话号码": 62902
          }
        }, {
          "压片间": {
            "电话号码": 62903
          }
        }, {
          "洁净区走廊": {
            "电话号码": 62905
          }
        }, {
          "铝塑间": {
            "电话号码": 62906
          }
        }, {
          "门厅": {
            "电话号码": 62907
          }
        }, {
          "机修": {
            "电话号码": 62908
          }
        }, {
          "洁净区洗衣间": {
            "电话号码": 62909
          }
        }]
      }, {
        "309车间": [{
          "办公室": {
            "电话号码": 63000
          }
        }, {
          "办公室": {
            "电话号码": 63001
          }
        }, {
          "办公室": {
            "电话号码": 63002
          }
        }, {
          "配剂": {
            "电话号码": 63003
          }
        }, {
          "注塑": {
            "电话号码": 63005
          }
        }, {
          "包装": {
            "电话号码": 63006
          }
        }, {
          "灭菌": {
            "电话号码": 63007
          }
        }, {
          "办公室": {
            "电话号码": 63008
          }
        }, {
          "洗衣房": {
            "电话号码": 63009
          }
        }, {
          "门厅": {
            "电话号码": 63010
          }
        }, {
          "机修": {
            "电话号码": 63011
          }
        }]
      }, {
        "310车间": [{
          "办公室": {
            "电话号码": 63100
          }
        }, {
          "浓配间": {
            "电话号码": 63101
          }
        }, {
          "扎盖间": {
            "电话号码": 63102
          }
        }, {
          "灭菌间": {
            "电话号码": 63103
          }
        }, {
          "包装标签室": {
            "电话号码": 63105
          }
        }, {
          "C级质控间": {
            "电话号码": 63106
          }
        }]
      }, {
        "311车间": [{
          "配剂": {
            "电话号码": 63200
          }
        }, {
          "器具": {
            "电话号码": 63201
          }
        }, {
          "灌封": {
            "电话号码": 63202
          }
        }, {
          "轧盖": {
            "电话号码": 63203
          }
        }, {
          "灭菌": {
            "电话号码": 63205
          }
        }, {
          "灯检": {
            "电话号码": 63206
          }
        }]
      }, {
        "312车间": [{
          "办公室": {
            "电话号码": 63300
          }
        }, {
          "办公室": {
            "电话号码": 63301
          }
        }, {
          "办公室": {
            "电话号码": 63302
          }
        }, {
          "器具洗衣间": {
            "电话号码": 63303
          }
        }, {
          "器具灭菌间": {
            "电话号码": 63305
          }
        }, {
          "配剂间": {
            "电话号码": 63306
          }
        }, {
          "C级质控间": {
            "电话号码": 63307
          }
        }, {
          "灌装间": {
            "电话号码": 63308
          }
        }, {
          "灌装上甁间": {
            "电话号码": 63309
          }
        }, {
          "轧盖间": {
            "电话号码": 63310
          }
        }, {
          "洗瓶灭菌间": {
            "电话号码": 63311
          }
        }, {
          "包装": {
            "电话号码": 63312
          }
        }, {
          "灯检": {
            "电话号码": 63313
          }
        }, {
          "冻干": {
            "电话号码": 63315
          }
        }, {
          "洗瓶拆包": {
            "电话号码": 63316
          }
        }]
      }, {
        "313车间": [{
          "办公室": {
            "电话号码": 63500
          }
        }, {
          "D级配剂": {
            "电话号码": 63501
          }
        }, {
          "灌装稀配走廊": {
            "电话号码": 63502
          }
        }, {
          "灭菌": {
            "电话号码": 63503
          }
        }, {
          "包装": {
            "电话号码": 63505
          }
        }, {
          "灯检": {
            "电话号码": 63506
          }
        }, {
          "注塑吹瓶": {
            "电话号码": 63507
          }
        }, {
          "门厅": {
            "电话号码": 63508
          }
        }]
      }, {
        "314车间": [{
          "灌装": {
            "电话号码": 63600
          }
        }, {
          "稀配": {
            "电话号码": 63601
          }
        }, {
          "灯检": {
            "电话号码": 63602
          }
        }, {
          "浓配": {
            "电话号码": 63603
          }
        }, {
          "灭菌": {
            "电话号码": 63605
          }
        }]
      }, {
        "315车间": [{
          "办公室": {
            "电话号码": 63700
          }
        }, {
          "办公室": {
            "电话号码": 63701
          }
        }, {
          "C级走廊": {
            "电话号码": 63702
          }
        }, {
          "灯检": {
            "电话号码": 63703
          }
        }, {
          "外包": {
            "电话号码": 63705
          }
        }, {
          "冻干": {
            "电话号码": 63706
          }
        }, {
          "浓配间": {
            "电话号码": 63707
          }
        }, {
          "洗衣间": {
            "电话号码": 63708
          }
        }, {
          "C级拆包间": {
            "电话号码": 63709
          }
        }, {
          "门厅": {
            "电话号码": 63710
          }
        }, {
          "总控室": {
            "电话号码": 63711
          }
        }, {
          "机修": {
            "电话号码": 63712
          }
        }, {
          "制水间": {
            "电话号码": 63713
          }
        }, {
          "灌装": {
            "电话号码": 63715
          }
        }, {
          "灌装": {
            "电话号码": 63716
          }
        }, {
          "洗瓶间": {
            "电话号码": 63717
          }
        }, {
          "一楼包装": {
            "电话号码": 63718
          }
        }, {
          "一楼灯检": {
            "电话号码": 63719
          }
        }]
      }, {
        "空调制水车间": [{
          "三期办公室": {
            "电话号码": 63900
          }
        }, {
          "三期制水": {
            "电话号码": 63901
          }
        }, {
          "三期空调": {
            "电话号码": 63902
          }
        }, {
          "三期空压": {
            "电话号码": 63903
          }
        }]
      }, {
        "质量中心质量管理部": [{
          "刘俊": {
            "电话号码": 65000
          }
        }, {
          "王琳": {
            "电话号码": 65001
          }
        }, {
          "方曼茹": {
            "电话号码": 65002
          }
        }, {
          "石文达": {
            "电话号码": 65003
          }
        }, {
          "孙洋洋": {
            "电话号码": 65005
          }
        }, {
          "李妍": {
            "电话号码": 65006
          }
        }, {
          "申雪皎": {
            "电话号码": 65007
          }
        }, {
          "李慧思": {
            "电话号码": 65008
          }
        }, {
          "传真": {
            "电话号码": 65009
          }
        }]
      }, {
        "质量控制部": [{
          "卢立波": {
            "电话号码": 65100
          }
        }, {
          "办公室": {
            "电话号码": 65101
          }
        }, {
          "办公室": {
            "电话号码": 65102
          }
        }, {
          "于金秋": {
            "电话号码": 65103
          }
        }, {
          "粉针岗": {
            "电话号码": 65105
          }
        }, {
          "理化室": {
            "电话号码": 65106
          }
        }, {
          "输液岗": {
            "电话号码": 65107
          }
        }, {
          "原料岗": {
            "电话号码": 65108
          }
        }, {
          "包材水岗": {
            "电话号码": 65109
          }
        }, {
          "气相室": {
            "电话号码": 65110
          }
        }, {
          "液相岗": {
            "电话号码": 65111
          }
        }, {
          "液相岗": {
            "电话号码": 65112
          }
        }, {
          "菌检岗": {
            "电话号码": 65113
          }
        }, {
          "标化岗": {
            "电话号码": 65115
          }
        }, {
          "样品室": {
            "电话号码": 65116
          }
        }, {
          "微生物操作": {
            "电话号码": 65117
          }
        }, {
          "阳性对照": {
            "电话号码": 65118
          }
        }, {
          "无菌操作": {
            "电话号码": 65119
          }
        }, {
          "门厅": {
            "电话号码": 65120
          }
        }, {
          "药理实验室": {
            "电话号码": 65121
          }
        }, {
          "热源室": {
            "电话号码": 65122
          }
        }]
      }, {
        "质量保证部": [{
          "施维": {
            "电话号码": 65200
          }
        }, {
          "刘磊": {
            "电话号码": 65201
          }
        }, {
          "315QA": {
            "电话号码": 65202
          }
        }, {
          "仓库/301QA": {
            "电话号码": 65203
          }
        }, {
          "315QA半检室": {
            "电话号码": 65205
          }
        }, {
          "304/311QA": {
            "电话号码": 65206
          }
        }, {
          "301QA": {
            "电话号码": 65207
          }
        }, {
          "刘智": {
            "电话号码": 65208
          }
        }, {
          "办公室": {
            "电话号码": 65209
          }
        }, {
          "302/309QA": {
            "电话号码": 65210
          }
        }, {
          "310/312QA": {
            "电话号码": 65211
          }
        }, {
          "313QA": {
            "电话号码": 65212
          }
        }, {
          "三期QA半检室": {
            "电话号码": 65213
          }
        }, {
          "三期仓库QA": {
            "电话号码": 65215
          }
        }, {
          "仓库QA": {
            "电话号码": 65216
          }
        }]
      }, {
        "验证部": [{
          "金明": {
            "电话号码": 65300
          }
        }, {
          "办公室": {
            "电话号码": 65301
          }
        }, {
          "办公室": {
            "电话号码": 65302
          }
        }, {
          "办公室": {
            "电话号码": 65303
          }
        }]
      }, {
        "药品不良反应监测办公室": [{
          "周文博": {
            "电话号码": 65500
          }
        }]
      }, {
        "国际认证办公室": [{
          "齐成男": {
            "电话号码": 65600
          }
        }, {
          "倪悦": {
            "电话号码": 65601
          }
        }, {
          "秦绪文": {
            "电话号码": 65602
          }
        }]
      }, {
        "健康事业部": [{
          "办公室": {
            "电话号码": 65700
          }
        }, {
          "办公室": {
            "电话号码": 65701
          }
        }, {
          "办公室": {
            "电话号码": 65702
          }
        }, {
          "外包": {
            "电话号码": 65703
          }
        }, {
          "洁净区": {
            "电话号码": 65705
          }
        }]
      }, {
        "技术部": [{
          "经理办公室": {
            "电话号码": 65800
          }
        }, {
          "办公室": {
            "电话号码": 65801
          }
        }, {
          "杨雨晴": {
            "电话号码": 65802
          }
        }, {
          "陈博": {
            "电话号码": 65803
          }
        }, {
          "王佳楠": {
            "电话号码": 65805
          }
        }, {
          "高丽莹": {
            "电话号码": 65806
          }
        }]
      }, {
        "工程部": [{
          "李洪文": {
            "电话号码": 65900
          }
        }, {
          "韩国栋": {
            "电话号码": 65901
          }
        }, {
          "白凤瑞": {
            "电话号码": 65902
          }
        }, {
          "办公室": {
            "电话号码": 65903
          }
        }, {
          "机修": {
            "电话号码": 65905
          }
        }]
      }, {
        "经算部": [{
          "姜玉艳": {
            "电话号码": 66000
          }
        }, {
          "办公室": {
            "电话号码": 66001
          }
        }]
      }, {
        "能源环保部": [{
          "刘淼": {
            "电话号码": 66100
          }
        }, {
          "办公室": {
            "电话号码": 66101
          }
        }, {
          "办公室": {
            "电话号码": 66102
          }
        }, {
          "煤化验": {
            "电话号码": 66103
          }
        }]
      }, {
        "安全部": [{
          "办公室": {
            "电话号码": 66200
          }
        }]
      }, {
        "设备部": [{
          "张琨/朱志鑫": {
            "电话号码": 66300
          }
        }, {
          "办公室": {
            "电话号码": 66301
          }
        }, {
          "办公室": {
            "电话号码": 66302
          }
        }]
      }, {
        "大输液筹建指挥部": [{
          "办公室": {
            "电话号码": 66500
          }
        }]
      }, {
        "采购部": [{
          "李军": {
            "电话号码": 66600
          }
        }, {
          "贺艺鹏": {
            "电话号码": 66601
          }
        }, {
          "马骏翼": {
            "电话号码": 66602
          }
        }, {
          "王尧": {
            "电话号码": 66603
          }
        }, {
          "毛娜娜": {
            "电话号码": 66605
          }
        }, {
          "姚丽丽": {
            "电话号码": 66606
          }
        }, {
          "马兰": {
            "电话号码": 66607
          }
        }, {
          "许亮": {
            "电话号码": 66608
          }
        }, {
          "孙武": {
            "电话号码": 66609
          }
        }, {
          "高国双": {
            "电话号码": 66610
          }
        }, {
          "廖福双": {
            "电话号码": 66611
          }
        }, {
          "王燕龙": {
            "电话号码": 66612
          }
        }, {
          "刘冰玉": {
            "电话号码": 66613
          }
        }]
      }, {
        "储运部": [{
          "邹环宇": {
            "电话号码": 66700
          }
        }, {
          "周永宽": {
            "电话号码": 66701
          }
        }, {
          "1号库": {
            "电话号码": 66703
          }
        }, {
          "2号库": {
            "电话号码": 66705
          }
        }, {
          "3号库": {
            "电话号码": 66706
          }
        }, {
          "3号库": {
            "电话号码": 66707
          }
        }, {
          "6号库": {
            "电话号码": 66708
          }
        }, {
          "6号库": {
            "电话号码": 66709
          }
        }, {
          "7号库": {
            "电话号码": 66710
          }
        }, {
          "8号库一楼": {
            "电话号码": 66711
          }
        }, {
          "8号库一楼": {
            "电话号码": 66712
          }
        }, {
          "8号库二楼": {
            "电话号码": 66713
          }
        }, {
          "8号库二楼": {
            "电话号码": 66715
          }
        }, {
          "8号库机修": {
            "电话号码": 66716
          }
        }, {
          "8号库机械手": {
            "电话号码": 66717
          }
        }, {
          "14号库": {
            "电话号码": 66718
          }
        }, {
          "任广慧": {
            "电话号码": 66719
          }
        }, {
          "何盼盼": {
            "电话号码": 66720
          }
        }, {
          "孙志敏": {
            "电话号码": 66721
          }
        }, {
          "物流办公室": {
            "电话号码": 66722
          }
        }, {
          "物流办公室": {
            "电话号码": 66723
          }
        }, {
          "物流办公室": {
            "电话号码": 66725
          }
        }]
      }, {
        "招投标部": [{
          "吴大勇": {
            "电话号码": 66800
          }
        }, {
          "赵利琴": {
            "电话号码": 66801
          }
        }, {
          "赵东明": {
            "电话号码": 66802
          }
        }]
      }, {
        "财务部": [{
          "出纳": {
            "电话号码": 66901
          }
        }, {
          "宫春颖": {
            "电话号码": 66902
          }
        }, {
          "邢威": {
            "电话号码": 66903
          }
        }, {
          "高鹏飞": {
            "电话号码": 66905
          }
        }, {
          "刘广茹": {
            "电话号码": 66906
          }
        }, {
          "毕文佳": {
            "电话号码": 66907
          }
        }, {
          "高彩虹": {
            "电话号码": 66908
          }
        }, {
          "于晨": {
            "电话号码": 66909
          }
        }, {
          "曾瑞": {
            "电话号码": 66910
          }
        }, {
          "张娜": {
            "电话号码": 66911
          }
        }, {
          "宁玉敏": {
            "电话号码": 66912
          }
        }, {
          "杨熹": {
            "电话号码": 66913
          }
        }, {
          "张明明": {
            "电话号码": 66915
          }
        }, {
          "查干": {
            "电话号码": 66916
          }
        }, {
          "刘子屿": {
            "电话号码": 66917
          }
        }, {
          "刘梦然": {
            "电话号码": 66918
          }
        }, {
          "办公室": {
            "电话号码": 66919
          }
        }, {
          "办公室": {
            "电话号码": 66920
          }
        }, {
          "办公室": {
            "电话号码": 66921
          }
        }]
      }, {
        "预算部": [{
          "吴宁": {
            "电话号码": 67000
          }
        }, {
          "鲁丽娜": {
            "电话号码": 67001
          }
        }, {
          "王大鹏": {
            "电话号码": 67002
          }
        }]
      }, {
        "薪酬绩效部": [{
          "陶媛": {
            "电话号码": 67100
          }
        }, {
          "武婷婷": {
            "电话号码": 67101
          }
        }, {
          "佘嘉颖": {
            "电话号码": 67102
          }
        }]
      }, {
        "招聘培训部": [{
          "李辉": {
            "电话号码": 67200
          }
        }, {
          "张玉红": {
            "电话号码": 67200
          }
        }, {
          "李丹丹": {
            "电话号码": 67201
          }
        }, {
          "杜凯昕": {
            "电话号码": 67202
          }
        }, {
          "于丽莹": {
            "电话号码": 67203
          }
        }]
      }, {
        "党群部": [{
          "王昕偊": {
            "电话号码": 67300
          }
        }, {
          "田野": {
            "电话号码": 67301
          }
        }]
      }, {
        "行政部后勤科": [{
          "王晓鹏": {
            "电话号码": 67500
          }
        }, {
          "梁洪宇": {
            "电话号码": 67501
          }
        }, {
          "办公室": {
            "电话号码": 67502
          }
        }, {
          "食堂后厨": {
            "电话号码": 67503
          }
        }, {
          "商务中心二楼": {
            "电话号码": 67505
          }
        }, {
          "商务中心三楼": {
            "电话号码": 67506
          }
        }, {
          "李艳涛": {
            "电话号码": 67507
          }
        }, {
          "司机休息室": {
            "电话号码": 67508
          }
        }]
      }, {
        "行政部安保科": [{
          "滕永胜": {
            "电话号码": 67600
          }
        }, {
          "前门卫": {
            "电话号码": 67601
          }
        }, {
          "后门卫": {
            "电话号码": 67602
          }
        }, {
          "三期门卫": {
            "电话号码": 67603
          }
        }, {
          "315消控室": {
            "电话号码": 67605
          }
        }]
      }, {
        "信息中心": [{
          "李顺宇": {
            "电话号码": 67700
          }
        }, {
          "段冰洋": {
            "电话号码": 67701
          }
        }, {
          "林松": {
            "电话号码": 67702
          }
        }, {
          "韩成龙": {
            "电话号码": 67703
          }
        }, {
          "李佩泽": {
            "电话号码": 67705
          }
        }, {
          "马海欣": {
            "电话号码": 67706
          }
        }]
      }, {
        "法务部": [{
          "冷建坤": {
            "电话号码": 67800
          }
        }]
      }, {
        "商务中心": [{
          "201房间/值班室": {
            "电话号码": 88201
          }
        }, {
          "202房间": {
            "电话号码": 88202
          }
        }, {
          "203房间": {
            "电话号码": 88203
          }
        }, {
          "204房间": {
            "电话号码": 88204
          }
        }, {
          "205房间": {
            "电话号码": 88205
          }
        }, {
          "301房间": {
            "电话号码": 88301
          }
        }, {
          "302房间": {
            "电话号码": 88302
          }
        }, {
          "303房间": {
            "电话号码": 88303
          }
        }, {
          "304房间": {
            "电话号码": 88304
          }
        }, {
          "305房间": {
            "电话号码": 88305
          }
        }, {
          "306房间": {
            "电话号码": 88306
          }
        }, {
          "307房间": {
            "电话号码": 88307
          }
        }, {
          "308房间": {
            "电话号码": 88308
          }
        }, {
          "309房间": {
            "电话号码": 88309
          }
        }, {
          "310房间": {
            "电话号码": 88310
          }
        }, {
          "311房间": {
            "电话号码": 88311
          }
        }, {
          "312房间": {
            "电话号码": 88312
          }
        }, {
          "314房间": {
            "电话号码": 88314
          }
        }]
      }, {
        "信息中心": [{
          "李顺宇": {
            "电话号码": 11111,
            "手机号码": 123456789,
            "邮箱": "lishunyu@medisan.cn"
          }
        }, {
          "段冰洋": {
            "电话号码": 22222,
            "手机号码": 123456789,
            "邮箱": "duanbingyang@medisan.cn"
          }
        }, {
          "马海欣": {
            "电话号码": 33333,
            "手机号码": 123456789,
            "邮箱": "mahaixin@medisan.cn"
          }
        }, {
          "林松": {
            "电话号码": 44444,
            "手机号码": 123456789,
            "邮箱": "linsong@medisan.cn"
          }
        }, {
          "韩成龙": {
            "电话号码": 55555,
            "手机号码": 123456789,
            "邮箱": "hanchenglong@medisan.cn"
          }
        }]
      }]
    }, {
      "兰西哈三联医药有限公司": [{
        "仓储部": [{
          "办公室": {
            "电话号码": 50100
          }
        }]
      }, {
        "财务部": [{
          "办公室": {
            "电话号码": 50200
          }
        }]
      }, {
        "财务部": [{
          "办公室": {
            "电话号码": 50201
          }
        }]
      }, {
        "业务部": [{
          "办公室": {
            "电话号码": 50300
          }
        }]
      }, {
        "质量部": [{
          "办公室": {
            "电话号码": 50500
          }
        }]
      }]
    }, {
      "哈尔滨裕阳进出口有限公司": [{
        "出口业务部": [{
          "张金玉": {
            "电话号码": 50600
          }
        }]
      }, {
        "出口业务部": [{
          "关雪松": {
            "电话号码": 50601
          }
        }]
      }, {
        "注册部": [{
          "潘宇": {
            "电话号码": 50700
          }
        }]
      }, {
        "国内业务部": [{
          "朱思文": {
            "电话号码": 50800
          }
        }]
      }]
    }, {
      "四环医药": [{
        "四环库": [{
          "办公室": {
            "电话号码": 70100
          }
        }]
      }]
    }, {
      "哈尔滨三联礼德生物科技有限公司": [{
        "总经理": [{
          "办公室": {
            "电话号码": '0451-56864706'
          }
        }]
      }, {
        "综合办公室": [{
          "办公室": {
            "电话号码": '0451-56864705-8000'
          }
        }]
      }, {
        "药物合成部": [{
          "办公室": {
            "电话号码": '0451-56864705-8855'
          }
        }]
      }, {
        "药物分析部": [{
          "办公室": {
            "电话号码": '0451-56864705-8822'
          }
        }]
      }, {
        "项目管理部": [{
          "办公室": {
            "电话号码": '0451-56864705-8855'
          }
        }]
      }]
    }, {
      "北京哈三联科技有限责任公司": [{
        "采购仓储部": [{
          "办公室": {
            "电话号码": '010-69701359-8120'
          }
        }]
      }, {
        "制剂研发部": [{
          "办公室": {
            "电话号码": '010-69701359-8097'
          }
        }]
      }, {
        "合成研发部": [{
          "办公室": {
            "电话号码": '010-69701359-8117'
          }
        }]
      }, {
        "质量保证部": [{
          "办公室": {
            "电话号码": '010-69701359-8019'
          }
        }]
      }, {
        "质量研发部": [{
          "办公室": {
            "电话号码": '010-69701359-8023'
          }
        }]
      }, {
        "财务部": [{
          "办公室": {
            "电话号码": '010-69701359-8008'
          }
        }]
      }, {
        "人事行政部": [{
          "办公室": {
            "电话号码": '010-69701359-8000'
          }
        }]
      }, {
        "综合办公室": [{
          "办公室": {
            "电话号码": '010-69701359-8000'
          }
        }]
      }]
    }, {
      "北京湃驰泰克医药科技有限公司": [{
        "综合管理部": [{
          "办公室": {
            "电话号码": '010-67866985'
          }
        }]
      }, {
        "研究开发部-分析部": [{
          "办公室": {
            "电话号码": '010-67866985'
          }
        }]
      }, {
        "研究开发部-制剂部": [{
          "办公室": {
            "电话号码": '010-67866985'
          }
        }]
      }, {
        "业务拓展部": [{
          "办公室": {
            "电话号码": '010-67866985'
          }
        }]
      }, {
        "财务部": [{
          "办公室": {
            "电话号码": '010-67866985'
          }
        }]
      }]
    }, {
      "济南循道科技有限公司": [{
        "行政部": [{
          "办公室": {
            "电话号码": '0531-88320009'
          }
        }]
      }, {
        "研发部": [{
          "办公室": {
            "电话号码": '0531-85991789'
          }
        }]
      }, {
        "财务部": [{
          "办公室": {
            "电话号码": '0531-88320009'
          }
        }]
      }]
    }, {
      "哈三联慈善基金会": [{
        "基金会成员": [{
          "周莉": {
            "职位": '理事长',
            "电话号码": '',
            "手机号码": '13845188989',
            "邮箱": 'zhouli@medisan.cn'
          }
        }, {
          "诸葛国民": {
            "职位": '副理事长',
            "电话号码": '',
            "手机号码": '13806413102',
            "邮箱": 'zhugeguomin@medisan.cn'
          }
        }, {
          "宁春荣": {
            "职位": '副理事长',
            "电话号码": '0451-51702375',
            "手机号码": '13811612187',
            "邮箱": 'ningchunrong@medisan.cn'
          }
        }, {
          "秦剑涛": {
            "职位": '理事',
            "电话号码": '60000',
            "手机号码": '13945016979',
            "邮箱": 'qinjiantao@medisan.cn'
          }
        }, {
          "秦剑波": {
            "职位": '理事',
            "电话号码": '60000',
            "手机号码": '15004667369',
            "邮箱": 'qinjianbo@medisan.cn'
          }
        }, {
          "赵志成": {
            "职位": '理事',
            "电话号码": '60008',
            "手机号码": '13936453189',
            "邮箱": 'zhaozhicheng@medisan.cn'
          }
        }, {
          "王昕偊": {
            "职位": '理事',
            "电话号码": '67300',
            "手机号码": '15945088911',
            "邮箱": 'wangxinyu@medisan.cn'
          }
        }, {
          "刘凤荣": {
            "职位": '监事',
            "电话号码": '60200',
            "手机号码": '15945086383',
            "邮箱": 'liufengrong@medisan.cn'
          }
        }, {
          "石小光": {
            "职位": '理事兼秘书长',
            "电话号码": '60301',
            "手机号码": '15603605447',
            "邮箱": 'shixiaoguang@medisan.cn'
          }
        }, {
          "王勇": {
            "职位": '副秘书长',
            "电话号码": '',
            "手机号码": '13935916001',
            "邮箱": ''
          }
        }, {
          "张佳佳": {
            "职位": '财务负责人',
            "电话号码": '',
            "手机号码": '15045057776',
            "邮箱": 'zhangjiajia@medisan.cn'
          }
        }]
      }]
    }, {
      "兰西哈三联": [{
        "技术部": [{
          "刘鹤": {
            "电话号码": 6028
          }
        }]
      }, {
        "生产部": [{
          "柳丽艳": {
            "电话号码": 6006
          }
        }, {
          "宫海成": {
            "电话号码": 6009
          }
        }]
      }, {
        "3101车间": [{
          "王学": {
            "电话号码": 6236
          }
        }, {
          "办公室": {
            "电话号码": 6242
          }
        }, {
          "1楼空调机房": {
            "电话号码": 6204
          }
        }, {
          "1楼半机修间": {
            "电话号码": 6173
          }
        }, {
          "洗衣间（洁净区）": {
            "电话号码": 6198
          }
        }, {
          "1楼半清洗间": {
            "电话号码": 6200
          }
        }, {
          "3101车间洗塞间": {
            "电话号码": 6184
          }
        }, {
          "3101车间C级走廊": {
            "电话号码": 6180
          }
        }, {
          "3101车间C级走廊": {
            "电话号码": 6177
          }
        }, {
          "灭菌室": {
            "电话号码": 6187
          }
        }, {
          "洗瓶间": {
            "电话号码": 6181
          }
        }, {
          "包装": {
            "电话号码": 6182
          }
        }, {
          "标签间": {
            "电话号码": 6258
          }
        }, {
          "稀配": {
            "电话号码": 6255
          }
        }, {
          "浓配": {
            "电话号码": 6248
          }
        }, {
          "灌装": {
            "电话号码": 6147
          }
        }, {
          "灯检": {
            "电话号码": 6253
          }
        }, {
          "器具": {
            "电话号码": 6249
          }
        }, {
          "轧盖": {
            "电话号码": 6259
          }
        }]
      }, {
        "3201车间": [{
          "办公室/李玉斌": {
            "电话号码": 6289
          }
        }, {
          "一般区": {
            "电话号码": 6286
          }
        }, {
          "洁净区": {
            "电话号码": 6144
          }
        }, {
          "门厅": {
            "电话号码": 6308
          }
        }]
      }, {
        "3202车间": [{
          "办公室/叶孝林": {
            "电话号码": 6297
          }
        }, {
          "工艺员办公室": {
            "电话号码": 6131
          }
        }, {
          "殷祥辉": {
            "电话号码": 6304
          }
        }, {
          "一般区": {
            "电话号码": 6135
          }
        }, {
          "洁净区走廊": {
            "电话号码": 6134
          }
        }, {
          "门厅": {
            "电话号码": 6296
          }
        }, {
          "一般区走廊": {
            "电话号码": 6295
          }
        }, {
          "质控间": {
            "电话号码": 6137
          }
        }, {
          "喷干线合成区": {
            "电话号码": 6314
          }
        }, {
          "喷干线D级走廊": {
            "电话号码": 6316
          }
        }, {
          "抗肿瘤一般区": {
            "电话号码": 6317
          }
        }]
      }, {
        "318车间": [{
          "办公室/王佰荣": {
            "电话号码": 6292
          }
        }, {
          "王长平": {
            "电话号码": 6146
          }
        }, {
          "QA": {
            "电话号码": 6299
          }
        }, {
          "质检楼办公室": {
            "电话号码": 6111
          }
        }, {
          "维修岗": {
            "电话号码": 6145
          }
        }, {
          "C级走廊": {
            "电话号码": 6140
          }
        }, {
          "D级走廊": {
            "电话号码": 6141
          }
        }, {
          "过滤间1": {
            "电话号码": 6139
          }
        }, {
          "过滤间2": {
            "电话号码": 6148
          }
        }, {
          "空调间制水间": {
            "电话号码": 6300
          }
        }]
      }, {
        "储运部": [{
          "刘巍": {
            "电话号码": 6009
          }
        }, {
          "1号库": {
            "电话号码": 6257
          }
        }, {
          "备件库": {
            "电话号码": 6124
          }
        }]
      }, {
        "空调制水车间": [{
          "张现计/王辉": {
            "电话号码": 6243
          }
        }, {
          "综合制剂制水间": {
            "电话号码": 6204
          }
        }, {
          "3202车间制水间": {
            "电话号码": 6302
          }
        }]
      }, {
        "质量控制中心": [{
          "办公室": {
            "电话号码": 6016
          }
        }, {
          "无菌岗": {
            "电话号码": 6054
          }
        }, {
          "无菌洁净区": {
            "电话号码": 6043
          }
        }, {
          "微检洁净区": {
            "电话号码": 6044
          }
        }, {
          "阳性洁净区": {
            "电话号码": 6045
          }
        }, {
          "原料岗": {
            "电话号码": 6051
          }
        }, {
          "气相岗": {
            "电话号码": 6030
          }
        }, {
          "液相岗": {
            "电话号码": 6029
          }
        }, {
          "液相准备室": {
            "电话号码": 6053
          }
        }, {
          "成品岗": {
            "电话号码": 6052
          }
        }, {
          "半检室": {
            "电话号码": 6172
          }
        }]
      }, {
        "GMP办公室": [{
          "办公室": {
            "电话号码": 6012
          }
        }]
      }, {
        "质量保证部": [{
          "办公室": {
            "电话号码": 6011
          }
        }, {
          "3101车间QA办公室": {
            "电话号码": 6235
          }
        }, {
          "3201车间QA办公室": {
            "电话号码": 6237
          }
        }, {
          "3202车间QA办公室": {
            "电话号码": 6298
          }
        }]
      }, {
        "项目部": [{
          "于婷/盖艳华": {
            "电话号码": 6014
          }
        }]
      }, {
        "综合部": [{
          "齐保成": {
            "电话号码": 6014
          }
        }]
      }, {
        "财务部": [{
          "王瑞": {
            "电话号码": 6019
          }
        }, {
          "办公室": {
            "电话号码": 6007
          }
        }]
      }, {
        "行政部": [{
          "办公室": {
            "电话号码": 6047
          }
        }, {
          "刘嘉旭": {
            "电话号码": 6125
          }
        }, {
          "前门卫": {
            "电话号码": 6114
          }
        }, {
          "后门卫": {
            "电话号码": 6311
          }
        }, {
          "食堂": {
            "电话号码": 3121
          }
        }, {
          "305值班室": {
            "电话号码": 6086
          }
        }]
      }, {
        "设备部": [{
          "办公室/臧家明": {
            "电话号码": 6212
          }
        }, {
          "杨璐": {
            "电话号码": 6213
          }
        }]
      }, {
        "安全办": [{
          "曹和平/于德顺": {
            "电话号码": 6018
          }
        }]
      }, {
        "工程部": [{
          "杜艳峰": {
            "电话号码": 6194
          }
        }, {
          "办公室": {
            "电话号码": 6197
          }
        }, {
          "李家发/周游": {
            "电话号码": 6211
          }
        }]
      }, {
        "动力车间": [{
          "1号变电所": {
            "电话号码": 6152
          }
        }, {
          "机修": {
            "电话号码": 6157
          }
        }, {
          "泵站": {
            "电话号码": 6156
          }
        }, {
          "锅炉控制室": {
            "电话号码": 6165
          }
        }, {
          "锅炉水化验": {
            "电话号码": 6162
          }
        }, {
          "司炉工休息室": {
            "电话号码": 6164
          }
        }, {
          "休息间": {
            "电话号码": 6166
          }
        }]
      }, {
        "采购部": [{
          "办公室": {
            "电话号码": 6001
          }
        }]
      }, {
        "能源环保部": [{
          "办公室": {
            "电话号码": 6020
          }
        }, {
          "污水处理站": {
            "电话号码": 6309
          }
        }, {
          "污水处理化验室": {
            "电话号码": 6310
          }
        }]
      }, {
        "人力资源部": [{
          "葛欣/于海波": {
            "电话号码": 6199
          }
        }, {
          "刘欣岩": {
            "电话号码": 6195
          }
        }]
      }, {
        "合成研发部": [{
          "办公室": {
            "电话号码": 6288
          }
        }, {
          "实验室": {
            "电话号码": 6291
          }
        }]
      }, {
        "制剂研发部": [{
          "办公室": {
            "电话号码": 6013
          }
        }]
      }, {
        "质量研发部": [{
          "办公室": {
            "电话号码": 6017
          }
        }]
      }]
    }]
  };
  this.methods = {
    onBottom: function onBottom(e) {
      var _this = this;

      (0, _index2.default)({
        message: "loadmore",
        duration: 1000
      });

      setTimeout(function () {
        var length = _this.lists.length;
        for (var i = length; i < length + LOADMORE_COUNT; ++i) {
          _this.lists.push(i + 1);
        }
      }, 800);
    },
    onScroll: function onScroll(e) {},
    tapOrgFunction: function tapOrgFunction(e) {
      console.log(e.currentTarget.dataset.idx, '===============');
      var index = e.currentTarget.dataset.idx;
      this.toporgdomshowId = index;
    },
    tapFunction: function tapFunction(e) {
      console.log(e.currentTarget.dataset.idx, '===============');
      var index = e.currentTarget.dataset.idx;
      this.topdomshowId = index;
      this.topchilddomshowId = -1;
    },
    tapChildFunction: function tapChildFunction(e) {
      console.log(e.currentTarget.dataset.idx, '===============');
      var index = e.currentTarget.dataset.idx;
      this.topchilddomshowId = index;
    }
  };
};

exports.default = new List();


exports.default = _chameleonRuntime2.default.createPage(exports.default).getOptions();

/***/ }),

/***/ "../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/cml-extract-css-webpack-plugin/dist/loader.js?{\"omit\":1,\"remove\":true}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/vue-style-loader/index.js!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/css-loader/index.js?{\"sourceMap\":false}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/chameleon-css-loader/index.js?{\"platform\":\"miniapp\",\"cmlType\":\"wx\"}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/postcss-loader/lib/index.js?{\"sourceMap\":false,\"config\":{\"path\":\"C:\\\\Users\\\\Administrator\\\\AppData\\\\Roaming\\\\npm\\\\node_modules\\\\chameleon-tool\\\\configs\\\\postcss\\\\wx\\\\.postcssrc.js\"}}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/less-loader/dist/cjs.js?{\"sourceMap\":false}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/chameleon-css-loader/index.js?{\"media\":true,\"cmlType\":\"wx\"}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/chameleon-loader/src/selector.js?type=styles&index=0&fileType=page&media=dev&cmlType=wx&isInjectBaseStyle=true&check={\"enable\":true,\"enableTypes\":[]}!./src/pages/phoneBook/phoneBook.cml":
/***/ (function(module, exports) {

// removed by extract-text-webpack-plugin

/***/ }),

/***/ "./src/pages/phoneBook/phoneBook.cml":
/***/ (function(module, exports, __webpack_require__) {

var __cml__style0 = __webpack_require__("../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/cml-extract-css-webpack-plugin/dist/loader.js?{\"omit\":1,\"remove\":true}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/vue-style-loader/index.js!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/css-loader/index.js?{\"sourceMap\":false}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/chameleon-css-loader/index.js?{\"platform\":\"miniapp\",\"cmlType\":\"wx\"}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/postcss-loader/lib/index.js?{\"sourceMap\":false,\"config\":{\"path\":\"C:\\\\Users\\\\Administrator\\\\AppData\\\\Roaming\\\\npm\\\\node_modules\\\\chameleon-tool\\\\configs\\\\postcss\\\\wx\\\\.postcssrc.js\"}}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/less-loader/dist/cjs.js?{\"sourceMap\":false}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/chameleon-css-loader/index.js?{\"media\":true,\"cmlType\":\"wx\"}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/chameleon-loader/src/selector.js?type=styles&index=0&fileType=page&media=dev&cmlType=wx&isInjectBaseStyle=true&check={\"enable\":true,\"enableTypes\":[]}!./src/pages/phoneBook/phoneBook.cml");
var __cml__script = __webpack_require__("../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/babel-loader/lib/index.js?{\"filename\":\"C:\\\\Users\\\\Administrator\\\\AppData\\\\Roaming\\\\npm\\\\node_modules\\\\chameleon-tool\\\\chameleon.js\"}!../Users/Administrator/AppData/Roaming/npm/node_modules/chameleon-tool/node_modules/chameleon-loader/src/selector.js?type=script&index=0&fileType=page&media=dev&cmlType=wx&isInjectBaseStyle=true&check={\"enable\":true,\"enableTypes\":[]}!./src/pages/phoneBook/phoneBook.cml");


/***/ })

},["./src/pages/phoneBook/phoneBook.cml"]);